RTX 4090/expr/results/omoe/qwen35-35b/20260412_091342_omoe-qwen3.5_limit120/benchmark_RR9.0.log
[INFO] Log file: /root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120/benchmark_RR9.0.log
[INFO] Config saved to /root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120/config.json
[INFO] Checking server availability...
[INFO] Server is ready
[INFO] Model ID: /data/share/models/qwen35_35b

>>> ============================================
>>> Benchmark RR=9.0 req/s
>>> ============================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7767bf5b6fc0>, trust_remote_code=False, seed=0, num_prompts=1000, dataset_name='sharegpt', no_stream=False, dataset_path='/root/workspace/dataset/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/data/share/models/qwen35_35b', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=9.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['framework=omoe,model=qwen35-35b,request_rate=9.0'], result_dir='/root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120/rr_9.0', result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-ed0fc114-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 9.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 1000/1000 [03:26<00:00,  4.84it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Request rate configured (RPS):           9.00      
Benchmark duration (s):                  206.58    
Total input tokens:                      224742    
Total generated tokens:                  207947    
Request throughput (req/s):              4.84      
Output token throughput (tok/s):         1006.62   
Peak output token throughput (tok/s):    2048.00   
Peak concurrent requests:                505.00    
Total token throughput (tok/s):          2094.54   
---------------Time to First Token----------------
Mean TTFT (ms):                          19782.54  
Median TTFT (ms):                        17199.58  
P99 TTFT (ms):                           33181.35  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          164.10    
Median TPOT (ms):                        171.50    
P99 TPOT (ms):                           201.56    
---------------Inter-token Latency----------------
Mean ITL (ms):                           157.02    
Median ITL (ms):                         159.84    
P99 ITL (ms):                            258.52    
==================================================
[OK] RR=9.0 done -> /root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120/rr_9.0/result.json

>>> ============================================
>>> Generating summary report...
>>> ============================================
  RR= 1.0: throughput=0.97 req/s, TTFT_mean=372.1ms, TPOT_mean=88.01ms
  RR= 3.0: throughput=2.68 req/s, TTFT_mean=878.2ms, TPOT_mean=107.73ms
  RR= 5.0: throughput=4.12 req/s, TTFT_mean=1718.1ms, TPOT_mean=116.49ms
  RR= 7.0: throughput=4.94 req/s, TTFT_mean=3628.8ms, TPOT_mean=155.64ms
  RR= 9.0: throughput=4.84 req/s, TTFT_mean=19782.5ms, TPOT_mean=164.10ms

[OK] Summary saved: /root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120/summary.json
[OK] Summary MD saved: /root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120/summary.md

============================================
  All Benchmarks Complete!
============================================
  Results:      /root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120
  Summary:      /root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120/summary.json
  Summary MD:   /root/workspace/expr/results/omoe/qwen3.5-35b/logs/20260412_091342_omoe-qwen3.5_limit120/summary.md
============================================